{
  "main": {
    "name":"Peter Park",
    "occupation":"recent college grad",
    "description":"Dedicated developer with a background in:\n•Development with Java for five years\n•Experience with MySQL as a relational database\n•Two years working with HTML, Javascript, and CSS \n•Experience with React, JSX, and Redux",
    "image":"profilepic.jpg",
    "bio":"Hi, I am a recent Virginia Tech graduate. I am most familiar with Java, but also have experience in C and Web-Development. I have done projects in PHP and JavaEE using well-known technologies like CSS, HTML, Javascript, and MySQL database. I am currently focused on reinforcing the basics of Web-Development as well as learning new technologies like React and Ruby.",
    "email": "geonwoo1996@gmail.com",
    "phone": "703-946-5116",
    "address":{
      "city":"Centreville",
      "state":"Virginia"
    },
    "website": "http://www.peterpark.me",
    "social":[
      {
        "name":"google-plus",
        "url":"https://plus.google.com/u/0/117151364986359701552",
        "className":"fa fa-google-plus"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/geonwoopark",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/geonrepository",
        "className":"fa fa-github"
      }

    ]
  },
  "resume":{
    "skillmessage":"Tech I have experience in, descending order of time spent with them",
    "education":[
      {
        "school":"Virginia Polytechnic Institute and State University",
        "degree":"B.S in Computer Science",
        "graduated":"May 2018",
        "description":"Learned how to use resources effectively, work efficiently as a team, and convert mistakes into growth."
      }
    ],
    "experience":[
      {
        "name":"Lunaverse",
        "title":"Intern",
        "years":"July 2018 - Present",
        "description":"Worked in a small team using Ruby/Rails and Google Translate API to develop a translation app.\n•Designed, set up, developed, and tested a new Ruby application\n•Followed AGILE methodology with daily Scrum meetings\n•Peer reviewed code and created pull-requests in Git"
      },
      {
        "name":"Personal Website",
        "title":"React based resume website",
        "tech":"React, AWS",
        "description":"Developed a React website that contains my skills, education, and experience.\n•Built using React, designed using SCSS, hosted with AWS\n•Made responsive for smaller screens"
      },
      {
        "name":"GETAR",
        "title":"Tweet Visualization",
        "tech":"Python, Tableau",
        "description":"Worked with a team to create visualizations of data from Twitter.\n•Retrieved tweet data and sentiment analysis using public API\n•Created Python scripts for processing large quantity of data\n•Overcame new obstacles that would rise with new requirements"
      },
      {
        "name":"LINbase",
        "title":"Website Maintenance",
        "tech":"PHP, CSS, HTML, MySQL",
        "description":"Pair-coded with colleague to maintain the website for LinBase.\n•Documented and cleaned code for better readability\n•Changed and improved website layout"
      },
      {
        "name":"Battle of the Rhine River",
        "title":"Creation of a Historical Website",
        "tech":"HTML, CSS, PHP, Javascript, Jquery, AJAX, MySQL, AWS",
        "description":"Created website documenting battle that occured at Rhine River.\n•Created RESTful endpoints to interface with historical data\n•Implemented UI for performing operations\n•Has user authentication and multiple levels of administration"
      }
    ],
    "skills":[
      {
        "image":"java.png",
        "name":"Java",
        "description":"This is the language I am by far the most familiar with. While I liked using Java for learning Object-oriented programming, I wanted to branch out into learning and using new technologies."
      },
      {
        "image":"git.png",
        "name":"Git",
        "description":"Git is a widely used version control system, which blew my mind when I first discovered it. Since then, I have learned great deal more about proper usage of commits, push, and pull request."
      },
      {
        "image":"html5.png",
        "name":"HTML, CSS, Javascript",
        "description":"HTML is the first ever \"technology\" that I've experienced. As I child I was amazed by the crude HTML page I could make. Now, I am eager to learn all the nuances of DOM."
      },
      {
        "image":"javaee.png",
        "name":"Java Enterprise Edition",
        "description":"Java EE and its subset specifications such as Java Server Faces, Persistence API, WebSocket, and Servlet was my first experience on creating a working web application."
      },
      {
        "image":"mysql.png",
        "name":"MySQL",
        "description":"Because Java EE supported MySQL, this has been the database of my choice."
      },
      {
        "image":"aws.png",
        "name":"Amazon Web Services",
        "description":"AWS the first and possibly the final step into launching my own web application. I hosted assignments on it during college, and now I host my own website on AWS S3."
      },
      {
        "image":"rubyonrails.png",
        "name":"Ruby on Rails",
        "description":"Ruby on Rails is one of the technologies that I am branching out into. Everything in Ruby makes sense, and I am slowly getting comfortable with using it."
      },
      {
        "image":"react.png",
        "name":"React",
        "description":"React is another new technology I wanted to learn. So far I really enjoy building user interfaces with React."
      }
      
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Simple Translator",
        "category":"Simple translator developed using Ruby on Rails and Google's API.",
        "image":"translator.png",
        "url":"https://github.com/GeonRepository/Translator"
      },
      {
        "title":"Tweet Visualization",
        "category":"Gathered Twitter data and created meaningful graphics related to reponse after school shooting.",
        "image":"shootings.png",
        "url":"https://vtechworks.lib.vt.edu/handle/10919/83216"
      },
      {
        "title":"Geographic Information System",
        "category":"Allows for browsing of geographic data via coordinates or location name.",
        "image":"gis.png",
        "url":"https://drive.google.com/open?id=0BzsCOfp4uCfbOXM4bS1tZm55X1U"
      }
    ]
  }
}
